Revit 2027 API
BuiltInFailures.ConstraintFailures.UndeletedConstraintsEQ Property
 A dimension that has EQ constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UndeletedConstraintsEQ { get; }
Public Shared ReadOnly Property UndeletedConstraintsEQ As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UndeletedConstraintsEQ {
	FailureDefinitionId^ get ();
}
static member UndeletedConstraintsEQ : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConstraintFailures Class
Autodesk.Revit.DB Namespace